src/Documents/СчетНаОплату/СчетНаОплату.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СчетНаОплату</name>
  <basedOn>Document.ВыполнениеПроектов</basedOn>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Плательщик</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриПечатиКоличествоРавно1</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Проекты</name>
    <attributes>
      <name>Клиент</name>
      <type>
        <types>CatalogRef.Клиенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроектПредставление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяВыполнения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>5</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/СчетНаОплату/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВыполнениеПроектов") Тогда
		// Заполнение шапки
		Плательщик                = "";
		Договор                   = ДанныеЗаполнения.Договор;
		Комментарий               = ДанныеЗаполнения.Комментарий;
		Контрагент                = ДанныеЗаполнения.Контрагент;
		Ответственный             = ДанныеЗаполнения.Ответственный;
		ПриПечатиКоличествоРавно1 = ДанныеЗаполнения.ПриПечатиКоличествоРавно1;
		Для Каждого ТекСтрокаПроекты Из ДанныеЗаполнения.Проекты Цикл
			НоваяСтрока                     = Проекты.Добавить();
			НоваяСтрока.ВремяВыполнения     = ТекСтрокаПроекты.ВремяВыполнения;
			НоваяСтрока.Клиент              = ТекСтрокаПроекты.Клиент;
			НоваяСтрока.Проект              = ТекСтрокаПроекты.Проект;
			НоваяСтрока.ПроектПредставление = ТекСтрокаПроекты.ПроектПредставление;
			НоваяСтрока.Сумма               = ТекСтрокаПроекты.Сумма;
			НоваяСтрока.Цена                = ТекСтрокаПроекты.Цена;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
